int outled = 13;
// تعریف متغیر گلوبال برای ال ای دی خروجی که در صورت نیاز به تغییر پین خروجی از این قسمت استفاده شود
// پین شماره 13 در آردوینو یونو ار 3 به یک ال ای دی روی برد وصل است و نیازی به اتصال ال ای دی خارجی نیست

// فانکشن ستاپ که فقط یکبار اجرا می شود void setup
void setup() {
pinMode(outled, OUTPUT);
// با دستور پین مود حالت پین را مشخص می کنیم که در اینجا پین خروجی است
}

// فانکشن لوپ که به طور مداوم اجرا می شود void loop
void loop() {
digitalWrite(outled,HIGH);
// با دستور دیجیتال رایت روی پین مشخص شده می نویسم که در اینجا با این دستور خروجی 1 منطقی یا روشن شدن ال ای دی است
delay(761);
// با دیلی یک تاخیر بر حسب میلی ثانیه ایجاد می کنیم تا دستورات بعدی بعد از اتمام تایم تاخیر اجرا شوند
digitalWrite(outled,LOW);
// خروجی پین مشخص شده را 0 منطقی یا ال ای دی را خاموش می کنیم 
delay(761);
// با دیلی یک تاخیر بر حسب میلی ثانیه ایجاد می کنیم تا دستورات بعدی بعد از اتمام تایم تاخیر اجرا شوند
}
//با اجرای این کد ال ای دی روی برد که متصل به پین 13 است چشمک می زند