int outled =9;
int outled1=8;
// تعریف متغیر گلوبال برای ال ای دی خروجی که در صورت نیاز به تغییر پین خروجی از این قسمت استفاده شود

// فانکشن ستاپ که فقط یکبار اجرا می شود void setup
void setup() {
pinMode(outled, OUTPUT);
pinMode(outled1, OUTPUT);
// با دستور پین مود حالت پین را مشخص می کنیم که در اینجا پین خروجی است
}

// فانکشن لوپ که به طور مداوم اجرا می شود void loop
void loop() {
digitalWrite(outled,HIGH);
// با دستور دیجیتال رایت روی پین مشخص شده می نویسم که در اینجا با این دستور خروجی 1 منطقی یا روشن شدن ال ای دی است
digitalWrite(outled1,LOW);
// خروجی پین مشخص شده را 0 منطقی یا ال ای دی را خاموش می کنیم
delay(852);
// با دیلی یک تاخیر بر حسب میلی ثانیه ایجاد می کنیم تا دستورات بعدی بعد از اتمام تایم تاخیر اجرا شوند
digitalWrite(outled,LOW);
// خروجی پین مشخص شده را 0 منطقی یا ال ای دی را خاموش می کنیم
digitalWrite(outled1,HIGH);
// خروجی پین مشخص شده را 1 منطقی یا ال ای دی را روشن می کنیم
delay(852);
// با دیلی یک تاخیر بر حسب میلی ثانیه ایجاد می کنیم تا دستورات بعدی بعد از اتمام تایم تاخیر اجرا شوند
}
//با اجرای این کد 2 عدد ال ای دی متصل به برد به صورت یکی در میان چشمک می زنند